OpenNuvoton/M030GBSP/Library/StdDriver/src/i2c.c
        case 0x18:                                         /* Slave Address ACK */
        case 0x28:
            if (u32txLen < u32wLen)
                I2C_SET_DATA(i2c, data[u32txLen++]);       /* Write Data to I2CDAT */
            else
            {
                u8Ctrl = I2C_CTL_STO_SI;                   /* Clear SI and send STOP */
                u8Xfering = 0U;
            }

            break;

        case 0x20:                                         /* Slave Address NACK */
        case 0x30:                                         /* Master transmit data NACK */
            u8Ctrl = I2C_CTL_STO_SI;                       /* Clear SI and send STOP */
            u8Err = 1U;
            break;

        case 0x38:                                         /* Arbitration Lost */
        default:                                           /* Unknown status */
            I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);      /* Clear SI and send STOP */

            u32TimeOutCount = SystemCoreClock;
            while(i2c->CTL0 & I2C_CTL0_STO_Msk)
            {
                u32TimeOutCount--;
                if(u32TimeOutCount == 0)
                {
                    g_I2C_i32ErrCode = I2C_TIMEOUT_ERR;
                    break;
                }
            }

            u8Ctrl = I2C_CTL_SI;
            u8Err = 1U;
            break;
        }

        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                  /* Write control bit to I2C_CTL register */
    }

    u32TimeOutCount = SystemCoreClock;
    while ((i2c)->CTL0 & I2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;
        if(u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_TIMEOUT_ERR;
            u8Err = 1U;
            break;
        }
    }

    return u32txLen;                                       /* Return bytes length that have been transmitted */
}

/**
  * @brief      Specify a byte register address and write a byte to Slave
  *
  * @param[in]  i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr    Access Slave address(7-bit)
  * @param[in]  u8DataAddr     Specify a address (1 byte) of data write to
  * @param[in]  data           A byte data to write it to Slave
  *
  * @retval     0              Write data success
  * @retval     1              Write data fail, or bus occurs error events
  *
  * @details    The function is used for I2C Master specify a address that data write to in Slave.
  *
  */

uint8_t I2C_WriteByteOneReg(I2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr, uint8_t data)
{
    uint32_t u32txLen = I2C_WriteMultiBytesOneReg(i2c, u8SlaveAddr, u8DataAddr, &data, 1);

    if (u32txLen == 1)
    {
        return 0; // Write data success
    }
    else
    {
        return 1; // Write data fail, or bus occurs error events
    }
}


/**
  * @brief      Specify a byte register address and write multi bytes to Slave
  *
  * @param[in]  i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr    Access Slave address(7-bit)
  * @param[in]  u8DataAddr     Specify a address (1 byte) of data write to
  * @param[in]  data[]         Pointer to array to write data to Slave
  * @param[in]  u32wLen        How many bytes need to write to Slave
  *
  * @return     A length of how many bytes have been transmitted.
  *
  * @details    The function is used for I2C Master specify a byte address that multi data bytes write to in Slave.
  *
  */

uint32_t I2C_WriteMultiBytesOneReg(I2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr, uint8_t data[], uint32_t u32wLen)
{
    uint8_t u8Xfering = 1U, u8Err = 0U, u8Ctrl = 0U;
    uint32_t u32txLen = 0U;
    uint32_t u32TimeOutCount;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                           /* Send START */

    while (u8Xfering && (u8Err == 0U))
    {
        u32TimeOutCount = SystemCoreClock;
        I2C_WAIT_READY(i2c)
        {
            u32TimeOutCount--;
            if(u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_TIMEOUT_ERR;
                u8Err = 1U;
                break;
            }
        }

        switch (I2C_GET_STATUS(i2c))
        {
        case 0x08:
            I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1U | 0x00U));    /* Write SLA+W to Register I2CDAT */
            u8Ctrl = I2C_CTL_SI;
            break;

        case 0x18:                                           /* Slave Address ACK */
            I2C_SET_DATA(i2c, u8DataAddr);                   /* Write Lo byte address of register */
            break;

        case 0x20:                                           /* Slave Address NACK */
        case 0x30:                                           /* Master transmit data NACK */
            u8Ctrl = I2C_CTL_STO_SI;                         /* Clear SI and send STOP */
            u8Err = 1U;
            break;

        case 0x28:
            if (u32txLen < u32wLen)
            {
                I2C_SET_DATA(i2c, data[u32txLen++]);
            }
            else
            {
                u8Ctrl = I2C_CTL_STO_SI;                     /* Clear SI and send STOP */
                u8Xfering = 0U;
            }

            break;

        case 0x38:                                           /* Arbitration Lost */
        default:                                             /* Unknown status */
            I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);        /* Clear SI and send STOP */

            u32TimeOutCount = SystemCoreClock;
            while(i2c->CTL0 & I2C_CTL0_STO_Msk)
            {
                u32TimeOutCount--;
                if(u32TimeOutCount == 0)
                {
                    g_I2C_i32ErrCode = I2C_TIMEOUT_ERR;
                    break;
                }
            }

            u8Ctrl = I2C_CTL_SI;
            u8Err = 1U;
            break;
        }

        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                    /* Write control bit to I2C_CTL register */
    }

    u32TimeOutCount = SystemCoreClock;
    while ((i2c)->CTL0 & I2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;
        if(u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_TIMEOUT_ERR;
            u8Err = 1U;
            break;
        }
    }

