OpenNuvoton/M030GBSP/Library/StdDriver/src/i2c.c
            u8Ctrl = I2C_CTL_SI;
            u8Err = 1U;
            break;
        }

        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                           /* Write control bit to I2C_CTL register */
    }

    u32TimeOutCount = SystemCoreClock;
    while ((i2c)->CTL0 & I2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;
        if(u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_TIMEOUT_ERR;
            u8Err = 1U;
            break;
        }
    }

    return u32rxLen;                                                /* Return bytes length that have been received */
}


/**
  * @brief      Specify a byte register address and read a byte from Slave
  *
  * @param[in]  i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr    Access Slave address(7-bit)
  * @param[in]  u8DataAddr     Specify a address(1 byte) of data read from
  *
  * @return     Read a byte data from Slave
  *
  * @details    The function is used for I2C Master specify a byte address that a data byte read from Slave.
  *
  *
  */
uint8_t I2C_ReadByteOneReg(I2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr)
{
    uint8_t data;

    uint32_t u32rxLen = I2C_ReadMultiBytesOneReg(i2c, u8SlaveAddr, u8DataAddr, &data, 1);

    if (u32rxLen == 1)
    {
        return data;
    }
    else
    {
        return 0; // Read data fail
    }
}

/**
  * @brief      Specify a byte register address and read multi bytes from Slave
  *
  * @param[in]  i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr    Access Slave address(7-bit)
  * @param[in]  u8DataAddr     Specify a address (1 byte) of data read from
  * @param[out] rdata[]        A data array to store data from Slave
  * @param[in]  u32rLen        How many bytes need to read from Slave
  *
  * @return     A length of how many bytes have been received
  *
  * @details    The function is used for I2C Master specify a byte address that multi data bytes read from Slave.
  *
  *
  */
uint32_t I2C_ReadMultiBytesOneReg(I2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr, uint8_t rdata[], uint32_t u32rLen)
{
    uint8_t u8Xfering = 1U, u8Err = 0U, u8Ctrl = 0U;
    uint32_t u32rxLen = 0U;
    uint32_t u32TimeOutCount;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                          /* Send START */

    while (u8Xfering && (u8Err == 0U))
    {
        u32TimeOutCount = SystemCoreClock;
        I2C_WAIT_READY(i2c)
        {
            u32TimeOutCount--;
            if(u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_TIMEOUT_ERR;
                u8Err = 1U;
                break;
            }
        }

        switch (I2C_GET_STATUS(i2c))
        {
        case 0x08:
            I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1U | 0x00U));    /* Write SLA+W to Register I2CDAT */
            u8Ctrl = I2C_CTL_SI;                             /* Clear SI */
            break;

        case 0x18:                                           /* Slave Address ACK */
            I2C_SET_DATA(i2c, u8DataAddr);                   /* Write Lo byte address of register */
            break;

        case 0x20:                                           /* Slave Address NACK */
        case 0x30:                                           /* Master transmit data NACK */
            u8Ctrl = I2C_CTL_STO_SI;                         /* Clear SI and send STOP */
            u8Err = 1U;
            break;

        case 0x28:
            u8Ctrl = I2C_CTL_STA_SI;                         /* Send repeat START */
            break;

        case 0x10:
            I2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1U) | 0x01U));  /* Write SLA+R to Register I2CDAT */
            u8Ctrl = I2C_CTL_SI;                             /* Clear SI */
            break;

        case 0x40:                                           /* Slave Address ACK */
            if (u32rLen == 1)
            {
                u8Ctrl = I2C_CTL_SI;                         /* Clear SI */
            }
            else
            {
                u8Ctrl = I2C_CTL_SI_AA;                      /* Clear SI and set ACK */
            }
            break;

        case 0x48:                                           /* Slave Address NACK */
            u8Ctrl = I2C_CTL_STO_SI;                         /* Clear SI and send STOP */
            u8Err = 1U;
            break;

        case 0x50:
            rdata[u32rxLen++] = (uint8_t) I2C_GET_DATA(i2c); /* Receive Data */

            if (u32rxLen < (u32rLen - 1U))
            {
                u8Ctrl = I2C_CTL_SI_AA;                      /* Clear SI and set ACK */
            }
            else
            {
                u8Ctrl = I2C_CTL_SI;                         /* Clear SI */
            }

            break;

        case 0x58:
            rdata[u32rxLen++] = (uint8_t) I2C_GET_DATA(i2c); /* Receive Data */
            u8Ctrl = I2C_CTL_STO_SI;                         /* Clear SI and send STOP */
            u8Xfering = 0U;
            break;

        case 0x38:                                           /* Arbitration Lost */
        default:                                             /* Unknown status */
            I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);        /* Clear SI and send STOP */

            u32TimeOutCount = SystemCoreClock;
            while(i2c->CTL0 & I2C_CTL0_STO_Msk)
            {
                u32TimeOutCount--;
                if(u32TimeOutCount == 0)
                {
                    g_I2C_i32ErrCode = I2C_TIMEOUT_ERR;
                    break;
                }
            }

            u8Ctrl = I2C_CTL_SI;
            u8Err = 1U;
            break;
        }

        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                    /* Write control bit to I2C_CTL register */
    }

    u32TimeOutCount = SystemCoreClock;
    while ((i2c)->CTL0 & I2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;
        if(u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_TIMEOUT_ERR;
            u8Err = 1U;
            break;
        }
    }

